*&---------------------------------------------------------------------*
*& Report ZRSA17_10
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zrsa17_10.

DATA: gv_a TYPE i,
      gv_b LIKE gv_a,
      gv_r LIKE gv_b.

gv_a = 10.
gv_b = 20.

*Subroutine
PERFORM cal USING gv_a gv_b "USING 은 값만 보내고 글로벌 변수는 건드리지 말라는 의미
            CHANGING gv_r. "CHANGING 은 값을 보내고 글로벌 변수도 변경된 것을 받아오겠다는 의미


WRITE gv_r.
*&---------------------------------------------------------------------*
*& Form cal
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM cal USING VALUE(p_a)
               VALUE(p_b)
         CHANGING
               VALUE(p_r). "p_a, p_b는 parameter 변수 -> subroutine 내에서 USING VALUE를 통해서 밖의 값을 받아오는 Local Variable. - Call by Value.

  p_a = 11.
  p_r = p_a + p_b.
ENDFORM.
